session2/cours/sgdbr.org
#+TITLE: Bases de données relationnelles et Java
#+AUTHOR: 
#+DATE: 

#+OPTIONS: ^:nil toc:2
#+LANGUAGE: fr
#+LATEX_HEADER: \usepackage[AUTO]{babel}

#+LaTeX_HEADER: \addtolength{\oddsidemargin}{-.475in}
#+LaTeX_HEADER:	\addtolength{\evensidemargin}{-.475in}
#+LaTeX_HEADER:	\addtolength{\textwidth}{1.75in}
#+LaTeX_HEADER:
#+LaTeX_HEADER:	\addtolength{\topmargin}{-1.75in}
#+LaTeX_HEADER:	\addtolength{\textheight}{2.75in}
#+LaTeX_HEADER: \usepackage{comment}

#+BEGIN_SRC elisp :exports none :results silent
(org-babel-do-load-languages 'org-babel-load-languages '((ditaa . t))) 
  (add-to-list 'org-latex-packages-alist '("" "listings"))
  (add-to-list 'org-latex-packages-alist '("" "color"))
  (add-to-list 'org-latex-packages-alist '("" "minted"))
  (setq org-latex-listings 'minted)

  (setq org-latex-pdf-process '("pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f"
                                "bibtex %b"
                                "pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f"
                                "pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f"))
  (setq org-latex-minted-options '(("frame" "lines")
                                   ("fontsize" "\\scriptsize")
                                   ("xleftmargin" "\\parindent")
                                   ("linenos" "")))
#+END_SRC


* Types de clients

** Clients SQL génériques

** Clients spécifiques à une base de données

https://www.pgadmin.org/

Il est ensuite possible de se connecter à
=horton.elephantsql.com@5432= avec le login =vnzaekhx= et le mot de
passe =oWN4ryvxxdjYWsko1u3WTW23k6yB7bM9= à la base de données du même
nom que le login. Pour travailler, il est recommandé de :

- créer votre propre base de données avec votre propre compte gratuit
  sur https://www.elephantsql.com/.
- [[https://doc.ubuntu-fr.org/postgresql][installer postgresql]] sur son poste de travail.


* Requêtes SQL
On peut effectuer des requêtes sur la base de données, soit à partir d'une
console dédiée, soit à partir d'un programme. Les requêtes sont exprimées dans
un langage spécifique, le *SQL*. Dans un premier temps, on effectuera les
requêtes à partir de consoles dédiées, puis on verra comment effectuer des
requêtes à partir d'un programme Java. Ensuite, on verra comment utiliser une
base de données avec un programme Java sans avoir forcément besoin d'écrire des
requêtes. En effet, la construction d'objets et même de collection d'objets, ou
leur persistance peut être automatisée par un *ORM*. 
Finalement, on verra que l'on peut, à l'intérieur
d'un programme Java, écrire des requêtes dans un autre langage, *JPQL*, qui
permet d'avoir la flexibilité d'un langage tout en gardant les facilités introduites par un ORM.

