session2/cours/sgdbr.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="fr" xml:lang="fr">
<head>
<!-- 2019-11-11 Mon 23:28 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Bases de données relationnelles et Java</title>
<meta name="generator" content="Org mode" />
</head>
<body>
<div id="content">
<h1 class="title">Bases de données relationnelles et Java</h1>
<div id="table-of-contents">
<h2>Table des matières</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org1abfe0d">1. Types de clients</a>
<ul>
<li><a href="#orgfcece04">1.1. Clients SQL génériques</a></li>
<li><a href="#org121b071">1.2. Clients spécifiques à une base de données</a></li>
</ul>
</li>
<li><a href="#org384b6e2">2. Requêtes SQL</a>
<ul>
<li><a href="#orgce9a4db">2.1. Sources de données</a></li>
<li><a href="#orgf0ff4af">2.2. Expressions</a></li>
<li><a href="#org4a047f5">2.3. Tris : clause ORDER BY</a></li>
<li><a href="#org08a93e7">2.4. Limitation du nombre de résultats : clause LIMIT et OFFSET</a></li>
<li><a href="#org9a3512b">2.5. Sélection de lignes : clause WHERE</a></li>
</ul>
</li>
<li><a href="#org4cba525">3. Création de la table cities</a></li>
<li><a href="#org355b2dc">4. Destruction de table</a></li>
<li><a href="#org81b1ed3">5. Insertions dans la table cities</a></li>
<li><a href="#org320e343">6. Suppression</a></li>
<li><a href="#org742ed79">7. Modification dans la table cities</a></li>
<li><a href="#org5cc8a75">8. Notion de transaction</a></li>
<li><a href="#org95e7502">9. Utilisation de SGBDR en Java : préliminaires</a>
<ul>
<li><a href="#orga22d5d0">9.1. Chargement de drivers</a></li>
<li><a href="#orgdbb0b48">9.2. Établissement de la connection au SGBDR</a></li>
</ul>
</li>
<li><a href="#org635d3f3">10. Utilisation de SGBDR en Java : requêtes SQL</a>
<ul>
<li><a href="#org8160e5f">10.1. java.sql.Statement</a></li>
<li><a href="#org3b6d854">10.2. java.sql.PreparedStatement</a></li>
<li><a href="#org55a5876">10.3. Lecture des résultats d'une requête SELECT</a></li>
<li><a href="#org63f18a2">10.4. Exemple de relation Many to Many, table d'associations</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org1abfe0d" class="outline-2">
<h2 id="org1abfe0d"><span class="section-number-2">1</span> Types de clients</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgfcece04" class="outline-3">
<h3 id="orgfcece04"><span class="section-number-3">1.1</span> Clients SQL génériques</h3>
</div>

<div id="outline-container-org121b071" class="outline-3">
<h3 id="org121b071"><span class="section-number-3">1.2</span> Clients spécifiques à une base de données</h3>
<div class="outline-text-3" id="text-1-2">
<p>
<a href="https://www.pgadmin.org/">https://www.pgadmin.org/</a>
</p>

<p>
Il est ensuite possible de se connecter à
<code>horton.elephantsql.com@5432</code> avec le login <code>vnzaekhx</code> et le mot de
passe <code>oWN4ryvxxdjYWsko1u3WTW23k6yB7bM9</code> à la base de données du même
nom que le login. Pour travailler, il est recommandé de :
</p>

<ul class="org-ul">
<li>créer votre propre base de données avec votre propre compte gratuit
sur <a href="https://www.elephantsql.com/">https://www.elephantsql.com/</a>.</li>
<li><a href="https://doc.ubuntu-fr.org/postgresql">installer postgresql</a> sur son poste de travail.</li>
</ul>
</div>
</div>
</div>


<div id="outline-container-org384b6e2" class="outline-2">
<h2 id="org384b6e2"><span class="section-number-2">2</span> Requêtes SQL</h2>
<div class="outline-text-2" id="text-2">
<p>
On peut effectuer des requêtes sur la base de données, soit à partir d'une
console dédiée, soit à partir d'un programme. Les requêtes sont exprimées dans
un langage spécifique, le <b>SQL</b>. Dans un premier temps, on effectuera les
requêtes à partir de consoles dédiées, puis on verra comment effectuer des
requêtes à partir d'un programme Java. Ensuite, on verra comment utiliser une
base de données avec un programme Java sans avoir forcément besoin d'écrire des
requêtes. En effet, la construction d'objets et même de collection d'objets, ou
leur persistance peut être automatisée par un <b>ORM</b>. 
Finalement, on verra que l'on peut, à l'intérieur
d'un programme Java, écrire des requêtes dans un autre langage, <b>JPQL</b>, qui
permet d'avoir la flexibilité d'un langage tout en gardant les facilités introduites par un ORM.
</p>
</div>
