session2/cours/sgdbr.html

<div id="outline-container-orgce9a4db" class="outline-3">
<h3 id="orgce9a4db"><span class="section-number-3">2.1</span> Sources de données</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Le langage SQL permet de sélectionner des données issues d'une source avec la
clause <code>SELECT</code>. Avec la table <code>cities</code> comme source de données, on peut
sélectionner toutes les données avec la requête SQL :
</p>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #0000FF;">SELECT</span> * <span style="color: #0000FF;">from</span> cities;
</pre>
</div>

<p>
Le <code>*</code> indique que les données de toutes les colonnes doivent être retournées.
On remarque, par rapport aux données stockées dans le fichier de la session
précédente qui servent à initialiser les attributs des objets de la class
<code>City</code>, qu'il y a en plus une colonne <code>id</code>. Celle-ci permet d'avoir une notion
d'<i>identité</i> pour les enregistrements (lignes) d'une table (même que la
référence sur un objet en Java) distincte de l'<i>égalité</i>. En base de données
relationnelles, on parle de <i>clé primaire</i> d'un table pour désigner la colonne
qui sert d'identifiant. On reviendra sur cette notion lors de la création de tables, en XXX.
</p>

<p>
On peut aussi ne spécifier que les colonnes qui nous intéressent, et indiquer
l'ordre dans lesquelles les informations de chaque ligne doivent être retournées :
</p>

<div class="org-src-container">
<pre class="src src-sql"><span style="color: #0000FF;">SELECT</span> latitude, longitude, <span style="color: #0000FF;">name</span>
<span style="color: #0000FF;">FROM</span> cities;
</pre>
</div>


<p>
Une base de données relationnelle peut bien évidemment, contenir plusieurs tables.
Par exemple, la base contient une table <code>regions_name</code> avec les régions et le nom de leur capitale :
</p>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #0000FF;">SELECT</span> * <span style="color: #0000FF;">from</span> regions_name;
</pre>
</div>

<p>
On peut sélectionner des données à partir de plusieurs tables, le résultat étant
alors le produit cartésien (c'est-à-dire toutes les combinaisons possibles!) des
différentes tables. L :
</p>
<div class="org-src-container">
<pre class="src src-sql"> <span style="color: #0000FF;">SELECT</span> * <span style="color: #0000FF;">from</span> regions_name, cities;
</pre>
</div>

<p>
Cette requête retourne 643796 lignes!
Bien sûr, en pratique, on utilisera le plus souvent pas toutes les lignes du produit cartésien entre deux table, mais on effectuera une <i>sélection</i> selon les valeurs de colonnes (et leurs relations).
On verra notamment la notion de <i>jointure</i> à l'aide d'une <i>clé étrangère</i>.
</p>


<p>
 De plus, celles-ci ne sont pas très
lisibles car il y a deux colonnes <code>id</code> et deux colonnes <code>names</code>, une pour
chacune des tables. Si l'on veut désigner une colonne, on peut (et on doit dans
le cas de même nom dans plusieurs tables, comme pour <code>id</code> et <code>name</code>), préfixer
le nom de colonne par le nom de la table :
</p>
<div class="org-src-container">
<pre class="src src-sql"> <span style="color: #0000FF;">SELECT</span> regions_name.<span style="color: #0000FF;">name</span>, regions_name.capital_name, cities.<span style="color: #0000FF;">name</span>, cities.longitude, cities.latitude <span style="color: #0000FF;">from</span> regions_name , cities;
</pre>
</div>

<p>
Pour éviter de réécrire à chaque fois tout le nom de la table pour chaque préfixe, on peut à la place désigner un <i>alias</i> pour les sources de données :
</p>

<div class="org-src-container">
<pre class="src src-sql"> <span style="color: #0000FF;">SELECT</span> r.<span style="color: #0000FF;">name</span>, capital_name, c.<span style="color: #0000FF;">name</span>, c.longitude,c.latitude <span style="color: #0000FF;">from</span> regions_name <span style="color: #0000FF;">as</span> r, cities <span style="color: #0000FF;">as</span> c;
</pre>
</div>

<p>
On peut aussi donner des noms aux colonnes du résultat avec le même mot-clé <i>as</i> :
</p>

<div class="org-src-container">
<pre class="src src-sql"><span style="color: #0000FF;">SELECT</span> regions_name.<span style="color: #0000FF;">name</span> <span style="color: #0000FF;">as</span> r_name, regions_name.capital_name <span style="color: #0000FF;">as</span> r_cname, cities.<span style="color: #0000FF;">name</span>, cities.longitude, cities.latitude <span style="color: #0000FF;">from</span> regions_name , cities;
</pre>
</div>
</div>
</div>
