session2/cours/sgdbr.md


<a id="orgeb1efc3"></a>

## Sources de données

Le langage SQL permet de sélectionner des données issues d'une source avec la clause `SELECT`. Avec la table `cities` comme source de données, on peut sélectionner toutes les données avec la requête SQL :

```sql
SELECT * from cities;
```

Le `*` indique que les données de toutes les colonnes doivent être retournées. On remarque, par rapport aux données stockées dans le fichier de la session précédente qui servent à initialiser les attributs des objets de la class `City`, qu'il y a en plus une colonne `id`. Celle-ci permet d'avoir une notion d'*identité* pour les enregistrements (lignes) d'une table (même que la référence sur un objet en Java) distincte de l'*égalité*. En base de données relationnelles, on parle de *clé primaire* d'un table pour désigner la colonne qui sert d'identifiant. On reviendra sur cette notion lors de la création de tables, en XXX.

On peut aussi ne spécifier que les colonnes qui nous intéressent, et indiquer l'ordre dans lesquelles les informations de chaque ligne doivent être retournées :

```sql
SELECT latitude, longitude, name
FROM cities;
```

Une base de données relationnelle peut bien évidemment, contenir plusieurs tables. Par exemple, la base contient une table `regions_name` avec les régions et le nom de leur capitale :

```sql
SELECT * from regions_name;
```

On peut sélectionner des données à partir de plusieurs tables, le résultat étant alors le produit cartésien (c'est-à-dire toutes les combinaisons possibles!) des différentes tables. L :

```sql
 SELECT * from regions_name, cities;
```

Cette requête retourne 643796 lignes! Bien sûr, en pratique, on utilisera le plus souvent pas toutes les lignes du produit cartésien entre deux table, mais on effectuera une *sélection* selon les valeurs de colonnes (et leurs relations). On verra notamment la notion de *jointure* à l'aide d'une *clé étrangère*.

De plus, celles-ci ne sont pas très lisibles car il y a deux colonnes `id` et deux colonnes `names`, une pour chacune des tables. Si l'on veut désigner une colonne, on peut (et on doit dans le cas de même nom dans plusieurs tables, comme pour `id` et `name`), préfixer le nom de colonne par le nom de la table :

```sql
 SELECT regions_name.name, regions_name.capital_name, cities.name, cities.longitude, cities.latitude from regions_name , cities;
```

Pour éviter de réécrire à chaque fois tout le nom de la table pour chaque préfixe, on peut à la place désigner un *alias* pour les sources de données :

```sql
 SELECT r.name, capital_name, c.name, c.longitude,c.latitude from regions_name as r, cities as c;
```

On peut aussi donner des noms aux colonnes du résultat avec le même mot-clé *as* :

```sql
SELECT regions_name.name as r_name, regions_name.capital_name as r_cname, cities.name, cities.longitude, cities.latitude from regions_name , cities;
```
