session2/cours/sgdbr.org
** Expressions

En fait, chaque colonne de résultat peut être une expression en fonction de 0 ou plusieurs des colonnes de la ou des source(s) de données :
#+BEGIN_SRC sql
SELECT LOWER(name), UPPER(capital_name), CONCAT(name, ' / ',capital_name), 10 from regions_name;
#+END_SRC

Lorsque l'on utilise une ou des expressions ne faisant pas intervenir de colonnes de la ou des sources de données, on peut ne pas avoir de source de données du tout :
#+BEGIN_SRC sql
SELECT 10 as longitude_ref, 4 as latitude_ref;
#+END_SRC

Finalement, on pourra utiliser un résultat de sélection comme une source de données à la place d'une table, en donnant un alias à ce résultat :
#+BEGIN_SRC sql
SELECT cstes.long, cstes.lat FROM (SELECT 10 as long, 4 as lat) as cstes;
#+END_SRC

Il est donc possible de composer des requêtes SQL, par exemple pour retourner les noms de villes et leurs distances par rapport à une longitude/latitude de référence :
#+BEGIN_SRC sql
SELECT name
, (6371* acos(cos(radians(ref.latitude))) * cos(radians(cities.latitude)) * cos(radians(cities.longitude) - radians(ref.longitude))
+sin(radians(cities.latitude)) * sin(radians(cities.latitude))) AS distance
	FROM cities
    ,(SELECT 48.8 AS latitude, 2.4333 AS longitude) AS ref;
#+END_SRC

Afin de gagner en lisibilité, on peut composer les sélections sans pour autant les imbriquer, à l'aide de la formulation [[https://www.postgresql.org/docs/current/static/queries-with.html][WITH]] :
#+BEGIN_SRC sql
WITH ref AS (SELECT 48.8 AS latitude, 2.4333 AS longitude)
SELECT name
, (6371* acos(cos(radians(ref.latitude))) * cos(radians(cities.latitude)) * cos(radians(cities.longitude) - radians(ref.longitude))
+sin(radians(cities.latitude)) * sin(radians(cities.latitude))) AS distance
	FROM cities, ref;
#+END_SRC


** Tris : clause ORDER BY

On peut trier les lignes de résultat en fonction d'une ou plusieurs expressions en fonction des valeurs des colonnes grâce à la clause [[https://www.postgresql.org/docs/current/static/queries-order.html][ORDER]] :
#+BEGIN_SRC sql
SELECT * from regions_name ORDER BY name ASC;
#+END_SRC

On peut classer par ordre croissant (=ASC=) ou décroissant (=DESC=). Si plusieurs critères de classement sont indiqués (séparés par des virgules)
, ils sont appliqués de façon à ce qu'un critère serve à classer les lignes qui sont équivalentes selon les crières précédents.

