session2/cours/sgdbr.html

<div id="outline-container-orgf0ff4af" class="outline-3">
<h3 id="orgf0ff4af"><span class="section-number-3">2.2</span> Expressions</h3>
<div class="outline-text-3" id="text-2-2">
<p>
En fait, chaque colonne de résultat peut être une expression en fonction de 0 ou plusieurs des colonnes de la ou des source(s) de données :
</p>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #0000FF;">SELECT</span> <span style="color: #006FE0;">LOWER</span>(<span style="color: #0000FF;">name</span>), <span style="color: #006FE0;">UPPER</span>(capital_name), CONCAT(<span style="color: #0000FF;">name</span>, <span style="color: #008000;">' / '</span>,capital_name), 10 <span style="color: #0000FF;">from</span> regions_name;
</pre>
</div>

<p>
Lorsque l'on utilise une ou des expressions ne faisant pas intervenir de colonnes de la ou des sources de données, on peut ne pas avoir de source de données du tout :
</p>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #0000FF;">SELECT</span> 10 <span style="color: #0000FF;">as</span> longitude_ref, 4 <span style="color: #0000FF;">as</span> latitude_ref;
</pre>
</div>

<p>
Finalement, on pourra utiliser un résultat de sélection comme une source de données à la place d'une table, en donnant un alias à ce résultat :
</p>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #0000FF;">SELECT</span> cstes.long, cstes.lat <span style="color: #0000FF;">FROM</span> (<span style="color: #0000FF;">SELECT</span> 10 <span style="color: #0000FF;">as</span> long, 4 <span style="color: #0000FF;">as</span> lat) <span style="color: #0000FF;">as</span> cstes;
</pre>
</div>

<p>
Il est donc possible de composer des requêtes SQL, par exemple pour retourner les noms de villes et leurs distances par rapport à une longitude/latitude de référence :
</p>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #0000FF;">SELECT</span> <span style="color: #0000FF;">name</span>
, (6371* acos(cos(radians(<span style="color: #6434A3;">ref</span>.latitude))) * cos(radians(cities.latitude)) * cos(radians(cities.longitude) - radians(<span style="color: #6434A3;">ref</span>.longitude))
+sin(radians(cities.latitude)) * sin(radians(cities.latitude))) <span style="color: #0000FF;">AS</span> distance
        <span style="color: #0000FF;">FROM</span> cities
    ,(<span style="color: #0000FF;">SELECT</span> 48.8 <span style="color: #0000FF;">AS</span> latitude, 2.4333 <span style="color: #0000FF;">AS</span> longitude) <span style="color: #0000FF;">AS</span> <span style="color: #6434A3;">ref</span>;
</pre>
</div>

<p>
Afin de gagner en lisibilité, on peut composer les sélections sans pour autant les imbriquer, à l'aide de la formulation <a href="https://www.postgresql.org/docs/current/static/queries-with.html">WITH</a> :
</p>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #0000FF;">WITH</span> <span style="color: #6434A3;">ref</span> <span style="color: #0000FF;">AS</span> (<span style="color: #0000FF;">SELECT</span> 48.8 <span style="color: #0000FF;">AS</span> latitude, 2.4333 <span style="color: #0000FF;">AS</span> longitude)
<span style="color: #0000FF;">SELECT</span> <span style="color: #0000FF;">name</span>
, (6371* acos(cos(radians(<span style="color: #6434A3;">ref</span>.latitude))) * cos(radians(cities.latitude)) * cos(radians(cities.longitude) - radians(<span style="color: #6434A3;">ref</span>.longitude))
+sin(radians(cities.latitude)) * sin(radians(cities.latitude))) <span style="color: #0000FF;">AS</span> distance
        <span style="color: #0000FF;">FROM</span> cities, <span style="color: #6434A3;">ref</span>;
</pre>
</div>
</div>
</div>


<div id="outline-container-org4a047f5" class="outline-3">
<h3 id="org4a047f5"><span class="section-number-3">2.3</span> Tris : clause ORDER BY</h3>
<div class="outline-text-3" id="text-2-3">
<p>
On peut trier les lignes de résultat en fonction d'une ou plusieurs expressions en fonction des valeurs des colonnes grâce à la clause <a href="https://www.postgresql.org/docs/current/static/queries-order.html">ORDER</a> :
</p>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #0000FF;">SELECT</span> * <span style="color: #0000FF;">from</span> regions_name <span style="color: #0000FF;">ORDER</span> <span style="color: #0000FF;">BY</span> <span style="color: #0000FF;">name</span> <span style="color: #0000FF;">ASC</span>;
</pre>
</div>

<p>
On peut classer par ordre croissant (<code>ASC</code>) ou décroissant (<code>DESC</code>). Si plusieurs critères de classement sont indiqués (séparés par des virgules)
, ils sont appliqués de façon à ce qu'un critère serve à classer les lignes qui sont équivalentes selon les crières précédents.
</p>
</div>
</div>
