session2/cours/sgdbr.org
** Limitation du nombre de résultats : clause LIMIT et OFFSET

Il est possible de ne récupérer qu'une partie des résultats d'une requête grâce
aux clauses [[https://www.postgresql.org/docs/current/static/queries-limit.html][LIMIT et OFFSET]]. =LIMIT= permet de ne récpérer qu'un nombre limité
de résultats. Par exemple pour ne récupérer que 10 lignes :

#+BEGIN_SRC sql
SELECT * from cities LIMIT 10;
#+END_SRC

La clause =OFFSET= permet, elle, de ne considérer les résultats qu'après avoir passé un nombre de lignes données.
Les deux clauses peuvent être combinées pour implémenter une pagination. Par exemple, on peut récupérer 10 résultats après avoir passé les 10 premiers :
#+BEGIN_SRC sql
SELECT * from cities LIMIT 10 OFFSET 10;
#+END_SRC

Bien sûr, ces clauses sont le plus utiles lorsqu'elles sont combinées avec une clause de classement :
#+BEGIN_SRC sql
SELECT * from cities ORDER BY name ASC LIMIT 10 OFFSET 10;
#+END_SRC

Voire :

#+BEGIN_SRC sql
WITH ref AS (SELECT 48.8 AS latitude, 2.4333 AS longitude)
SELECT name
, (6371* acos(sin(radians(ref.latitude)) * sin(radians(cities.latitude)) + cos(radians(cities.latitude)) * cos(radians(ref.latitude)) *
 cos( radians(ref.longitude) - radians(cities.longitude)))
+sin(radians(cities.latitude)) * sin(radians(cities.latitude))) AS distance
	FROM cities, ref ORDER BY distance ASC LIMIT 10;
#+END_SRC

En traduisant en SQL la fonction de distance entre coordonnées GPS basée sur la
   [[https://fr.wikipedia.org/wiki/Loi_des_cosinus#En_g.C3.A9om.C3.A9trie_sph.C3.A9rique][loi des cosinus en coordonnées sphériques]] .
Avec une formule plus précise de [[https://fr.wikipedia.org/wiki/Distance_du_grand_cercle][Distance du grand cercle]], on a :
#+BEGIN_SRC sql
WITH ref AS (SELECT 48.8 AS latitude, 2.4333 AS longitude),
delta_radians AS (SELECT name, latitude, longitude, radians(cities.latitude - ref.latitude) as delta_latitude, radians(cities.longitude - ref.longitude) as delta_longitude FROM cities, ref),
sin_dr AS ( SELECT name, latitude, longitude, sin(dr.delta_latitude/2) as lat, sin(dr.delta_longitude/2) as long FROM delta_radians as dr),
tmp AS (SELECT name, sin_dr.lat * sin_dr.lat + cos(radians(sin_dr.latitude)) * cos(radians(ref.latitude)) * sin_dr.long * sin_dr.long as a FROM sin_dr, ref)
SELECT name
, (6371 * 2 * atan2(sqrt(a), sqrt(1-a))) as distance
	FROM tmp ORDER BY distance ASC LIMIT 10;
#+END_SRC

** Sélection de lignes : clause WHERE




#+BEGIN_SRC sql :exports none
CREATE TABLE regions_name (id SERIAL PRIMARY KEY, name VARCHAR(255), capital_name VARCHAR(255));
INSERT INTO regions_name VALUES (DEFAULT, 'Grand-Est', 'Strasbourg');
INSERT INTO regions_name VALUES (DEFAULT, 'Nouvelle-Aquitaine', 'Bordeaux');
INSERT INTO regions_name VALUES (DEFAULT, 'Auvergne-Rhône-Alpes', 'Lyon');
INSERT INTO cities VALUES(DEFAULT, 'Lyon', 4.84, 45.76); 


INSERT INTO regions_name VALUES (DEFAULT, 'Bourgogne-Franche-Comté', 'Dijon');
INSERT INTO regions_name VALUES (DEFAULT, 'Bretagne', 'Rennes');
INSERT INTO regions_name VALUES (DEFAULT, 'Centre-Val de Loire', 'Orléans');
INSERT INTO regions_name VALUES (DEFAULT, 'Île-de-France', 'Paris');
INSERT INTO cities VALUES(DEFAULT, 'Paris', 2.3508, 48.8567); 
INSERT INTO regions_name VALUES (DEFAULT, 'Occitanie', 'Toulouse');
INSERT INTO regions_name VALUES (DEFAULT, 'Hauts-de-France', 'Lille');
INSERT INTO regions_name VALUES (DEFAULT, 'Normandie', 'Rouen');
INSERT INTO regions_name VALUES (DEFAULT, 'Pays de la Loire', 'Nantes');
INSERT INTO regions_name VALUES (DEFAULT, 'Provence-Alpes-Côte d''Azur', 'Marseille');
INSERT INTO cities VALUES(DEFAULT, 'Marseille', 5.37, 43.2964); 

INSERT INTO regions_name VALUES (DEFAULT, 'Corse', 'Ajaccio');

INSERT INTO regions_name VALUES (DEFAULT, 'Guyane', 'Cayenne');
INSERT INTO cities VALUES(DEFAULT, 'Cayenne', -52.326, 4.9372);

INSERT INTO regions_name VALUES (DEFAULT, 'Guadeloupe', 'Basse-Terre');
INSERT INTO cities VALUES(DEFAULT, 'Basse-Terre', -61.7292, 15.9958);


INSERT INTO regions_name VALUES (DEFAULT, 'Martinique', 'Fort-de-France');
INSERT INTO cities VALUES(DEFAULT, 'Fort-de-France', -61.0833, 14.6);

INSERT INTO regions_name VALUES (DEFAULT, 'Mayotte', 'Mamoudzou');
INSERT INTO cities VALUES(DEFAULT, 'Mamoudzou', 45.2278, -12.7806);

INSERT INTO regions_name VALUES (DEFAULT, 'La Réunion', 'Saint-Denis');
#+END_SRC

