session2/cours/sgdbr.html

<div id="outline-container-org08a93e7" class="outline-3">
<h3 id="org08a93e7"><span class="section-number-3">2.4</span> Limitation du nombre de résultats : clause LIMIT et OFFSET</h3>
<div class="outline-text-3" id="text-2-4">
<p>
Il est possible de ne récupérer qu'une partie des résultats d'une requête grâce
aux clauses <a href="https://www.postgresql.org/docs/current/static/queries-limit.html">LIMIT et OFFSET</a>. <code>LIMIT</code> permet de ne récpérer qu'un nombre limité
de résultats. Par exemple pour ne récupérer que 10 lignes :
</p>

<div class="org-src-container">
<pre class="src src-sql"><span style="color: #0000FF;">SELECT</span> * <span style="color: #0000FF;">from</span> cities <span style="color: #0000FF;">LIMIT</span> 10;
</pre>
</div>

<p>
La clause <code>OFFSET</code> permet, elle, de ne considérer les résultats qu'après avoir passé un nombre de lignes données.
Les deux clauses peuvent être combinées pour implémenter une pagination. Par exemple, on peut récupérer 10 résultats après avoir passé les 10 premiers :
</p>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #0000FF;">SELECT</span> * <span style="color: #0000FF;">from</span> cities <span style="color: #0000FF;">LIMIT</span> 10 OFFSET 10;
</pre>
</div>

<p>
Bien sûr, ces clauses sont le plus utiles lorsqu'elles sont combinées avec une clause de classement :
</p>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #0000FF;">SELECT</span> * <span style="color: #0000FF;">from</span> cities <span style="color: #0000FF;">ORDER</span> <span style="color: #0000FF;">BY</span> <span style="color: #0000FF;">name</span> <span style="color: #0000FF;">ASC</span> <span style="color: #0000FF;">LIMIT</span> 10 OFFSET 10;
</pre>
</div>

<p>
Voire :
</p>

<div class="org-src-container">
<pre class="src src-sql"><span style="color: #0000FF;">WITH</span> <span style="color: #6434A3;">ref</span> <span style="color: #0000FF;">AS</span> (<span style="color: #0000FF;">SELECT</span> 48.8 <span style="color: #0000FF;">AS</span> latitude, 2.4333 <span style="color: #0000FF;">AS</span> longitude)
<span style="color: #0000FF;">SELECT</span> <span style="color: #0000FF;">name</span>
, (6371* acos(sin(radians(<span style="color: #6434A3;">ref</span>.latitude)) * sin(radians(cities.latitude)) + cos(radians(cities.latitude)) * cos(radians(<span style="color: #6434A3;">ref</span>.latitude)) *
 cos( radians(<span style="color: #6434A3;">ref</span>.longitude) - radians(cities.longitude)))
+sin(radians(cities.latitude)) * sin(radians(cities.latitude))) <span style="color: #0000FF;">AS</span> distance
        <span style="color: #0000FF;">FROM</span> cities, <span style="color: #6434A3;">ref</span> <span style="color: #0000FF;">ORDER</span> <span style="color: #0000FF;">BY</span> distance <span style="color: #0000FF;">ASC</span> <span style="color: #0000FF;">LIMIT</span> 10;
</pre>
</div>

<p>
En traduisant en SQL la fonction de distance entre coordonnées GPS basée sur la
   <a href="https://fr.wikipedia.org/wiki/Loi_des_cosinus#En_g.C3.A9om.C3.A9trie_sph.C3.A9rique">loi des cosinus en coordonnées sphériques</a> .
Avec une formule plus précise de <a href="https://fr.wikipedia.org/wiki/Distance_du_grand_cercle">Distance du grand cercle</a>, on a :
</p>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #0000FF;">WITH</span> <span style="color: #6434A3;">ref</span> <span style="color: #0000FF;">AS</span> (<span style="color: #0000FF;">SELECT</span> 48.8 <span style="color: #0000FF;">AS</span> latitude, 2.4333 <span style="color: #0000FF;">AS</span> longitude),
delta_radians <span style="color: #0000FF;">AS</span> (<span style="color: #0000FF;">SELECT</span> <span style="color: #0000FF;">name</span>, latitude, longitude, radians(cities.latitude - <span style="color: #6434A3;">ref</span>.latitude) <span style="color: #0000FF;">as</span> delta_latitude, radians(cities.longitude - <span style="color: #6434A3;">ref</span>.longitude) <span style="color: #0000FF;">as</span> delta_longitude <span style="color: #0000FF;">FROM</span> cities, <span style="color: #6434A3;">ref</span>),
sin_dr <span style="color: #0000FF;">AS</span> ( <span style="color: #0000FF;">SELECT</span> <span style="color: #0000FF;">name</span>, latitude, longitude, sin(dr.delta_latitude/2) <span style="color: #0000FF;">as</span> lat, sin(dr.delta_longitude/2) <span style="color: #0000FF;">as</span> long <span style="color: #0000FF;">FROM</span> delta_radians <span style="color: #0000FF;">as</span> dr),
tmp <span style="color: #0000FF;">AS</span> (<span style="color: #0000FF;">SELECT</span> <span style="color: #0000FF;">name</span>, sin_dr.lat * sin_dr.lat + cos(radians(sin_dr.latitude)) * cos(radians(<span style="color: #6434A3;">ref</span>.latitude)) * sin_dr.long * sin_dr.long <span style="color: #0000FF;">as</span> a <span style="color: #0000FF;">FROM</span> sin_dr, <span style="color: #6434A3;">ref</span>)
<span style="color: #0000FF;">SELECT</span> <span style="color: #0000FF;">name</span>
, (6371 * 2 * atan2(sqrt(a), sqrt(1-a))) <span style="color: #0000FF;">as</span> distance
        <span style="color: #0000FF;">FROM</span> tmp <span style="color: #0000FF;">ORDER</span> <span style="color: #0000FF;">BY</span> distance <span style="color: #0000FF;">ASC</span> <span style="color: #0000FF;">LIMIT</span> 10;
</pre>
</div>
</div>
</div>

<div id="outline-container-org9a3512b" class="outline-3">
<h3 id="org9a3512b"><span class="section-number-3">2.5</span> Sélection de lignes : clause WHERE</h3>
</div>
</div>
