session2/cours/sgdbr.md


<a id="org9fbaed9"></a>

## Limitation du nombre de résultats : clause LIMIT et OFFSET

Il est possible de ne récupérer qu'une partie des résultats d'une requête grâce aux clauses [LIMIT et OFFSET](https://www.postgresql.org/docs/current/static/queries-limit.html). `LIMIT` permet de ne récpérer qu'un nombre limité de résultats. Par exemple pour ne récupérer que 10 lignes :

```sql
SELECT * from cities LIMIT 10;
```

La clause `OFFSET` permet, elle, de ne considérer les résultats qu'après avoir passé un nombre de lignes données. Les deux clauses peuvent être combinées pour implémenter une pagination. Par exemple, on peut récupérer 10 résultats après avoir passé les 10 premiers :

```sql
SELECT * from cities LIMIT 10 OFFSET 10;
```

Bien sûr, ces clauses sont le plus utiles lorsqu'elles sont combinées avec une clause de classement :

```sql
SELECT * from cities ORDER BY name ASC LIMIT 10 OFFSET 10;
```

Voire :

```sql
WITH ref AS (SELECT 48.8 AS latitude, 2.4333 AS longitude)
SELECT name
, (6371* acos(sin(radians(ref.latitude)) * sin(radians(cities.latitude)) + cos(radians(cities.latitude)) * cos(radians(ref.latitude)) *
 cos( radians(ref.longitude) - radians(cities.longitude)))
+sin(radians(cities.latitude)) * sin(radians(cities.latitude))) AS distance
	FROM cities, ref ORDER BY distance ASC LIMIT 10;
```

En traduisant en SQL la fonction de distance entre coordonnées GPS basée sur la [loi des cosinus en coordonnées sphériques](https://fr.wikipedia.org/wiki/Loi_des_cosinus#En_g.C3.A9om.C3.A9trie_sph.C3.A9rique) . Avec une formule plus précise de [Distance du grand cercle](https://fr.wikipedia.org/wiki/Distance_du_grand_cercle), on a :

```sql
WITH ref AS (SELECT 48.8 AS latitude, 2.4333 AS longitude),
delta_radians AS (SELECT name, latitude, longitude, radians(cities.latitude - ref.latitude) as delta_latitude, radians(cities.longitude - ref.longitude) as delta_longitude FROM cities, ref),
sin_dr AS ( SELECT name, latitude, longitude, sin(dr.delta_latitude/2) as lat, sin(dr.delta_longitude/2) as long FROM delta_radians as dr),
tmp AS (SELECT name, sin_dr.lat * sin_dr.lat + cos(radians(sin_dr.latitude)) * cos(radians(ref.latitude)) * sin_dr.long * sin_dr.long as a FROM sin_dr, ref)
SELECT name
, (6371 * 2 * atan2(sqrt(a), sqrt(1-a))) as distance
	FROM tmp ORDER BY distance ASC LIMIT 10;
```


<a id="orgb9dc0f7"></a>

## Sélection de lignes : clause WHERE
