session2/cours/sgdbr.html




<div id="outline-container-org4cba525" class="outline-2">
<h2 id="org4cba525"><span class="section-number-2">3</span> Création de la table cities</h2>
<div class="outline-text-2" id="text-3">
<p>
En fait, on va créer la table <code>cities</code> sur le serveur Postgresql distant à partir d'une sélection des colonnes d'une table d'une base de données existante.
La table source sera sur le serveur MySQL distant hébergé gratuitement à <code>jdbc:mysql://db4free.net:3306/random_user</code> avec les login est mot de passe :
<code>random_user</code> et <code>1mot2passe</code>, à partir des donnés mises à disposition par <a href="http://sql.sh/736-base-donnees-villes-francaises">données mises à disposition par Tony Archambeau</a>.
</p>

<p>
La table destination sera sur le serveur Postgresql distant vu plus haut XXX.
</p>

<p>
On va créer la table city sur le serveur postgresql avec la commande SQL suivante :
</p>



<div class="org-src-container">
<pre class="src src-sql">      <span style="color: #0000FF;">CREATE</span> <span style="color: #0000FF;">TABLE</span> <span style="color: #006699;">cities</span> (
      id SERIAL <span style="color: #0000FF;">PRIMARY</span> <span style="color: #0000FF;">KEY</span>,
      <span style="color: #0000FF;">name</span> <span style="color: #6434A3;">VARCHAR</span>(255) <span style="color: #0000FF;">NOT</span> <span style="color: #0000FF;">NULL</span>,
      departement <span style="color: #6434A3;">VARCHAR</span>(3),
      postal_codes <span style="color: #6434A3;">VARCHAR</span>(255),
      pop_1999 <span style="color: #6434A3;">INTEGER</span> <span style="color: #0000FF;">CHECK</span> (pop_1999 &gt;= 0),
      pop_2010 <span style="color: #6434A3;">INTEGER</span> <span style="color: #0000FF;">CHECK</span> (pop_2010 &gt;= 0),
      pop_2012 <span style="color: #6434A3;">INTEGER</span> <span style="color: #0000FF;">CHECK</span> (pop_2012 &gt;= 0),
      area <span style="color: #6434A3;">DOUBLE</span> <span style="color: #6434A3;">PRECISION</span>  <span style="color: #0000FF;">CHECK</span> (area &gt;= 0.),
      longitude <span style="color: #6434A3;">DOUBLE</span> <span style="color: #6434A3;">PRECISION</span> <span style="color: #0000FF;">NOT</span> <span style="color: #0000FF;">NULL</span>,
      latitude <span style="color: #6434A3;">DOUBLE</span> <span style="color: #6434A3;">PRECISION</span> <span style="color: #0000FF;">NOT</span> <span style="color: #0000FF;">NULL</span>,
      z_min <span style="color: #6434A3;">INTEGER</span>,
      z_max <span style="color: #6434A3;">INTEGER</span>,
      <span style="color: #0000FF;">CHECK</span> (z_min &lt;= z_max));
</pre>
</div>


<ul class="org-ul">
<li>La colonne <code>id</code> est une clé primaire (<i>PRIMARY KEY</i>) qui permet donc
l'identification de chaque ligne de la table. On laissera la base de données
attribuer une valeur unique à chaque nouvelle ligne ajoutée à la table (on
mettra <code>DEFAULT</code> en valeur). On indique à la base d'utiliser des valeurs
entières successives (<code>SERIAL</code>). La base de donnée s'assure que les valeurs
des identifiants sont uniques dans la table : deux lignes ne peuvent pas
avoir la même valeur de clé primaire. De plus, comme la recherche d'une ligne
à partir de la valeur de son identifiant doit être très rapide, la clé
primaire est automatiquement associée à un <i>index</i> qui permet d'accélérer les
recherches.</li>
</ul>


<ul class="org-ul">
<li>La colonne <code>name</code> contiendra une chaîne d'au maximum 255 caractères et
n'autorise pas de valeur manquante (<code>NULL</code>).</li>

<li>La colonne <code>departement</code> contiendra une chaîne d'au maximum 3 caractères pour
le code du département de la ville.</li>

<li>la colonne <code>postal_codes</code> contiendra une chaîne d'au maximum 255 caractères
pour stocker le ou les codes postaux de la ville. En cas de plusieurs codes
postaux, ceux-ci sont séparés par le caractère '-'. Ce n'est pas la
représentation la plus pratique d'une liste, et nous verrons en XXX d'autres
solutions.</li>

<li>les colonnes <code>pop_1999</code>, <code>pop_2010</code> et <code>pop_2012</code> contiennent les populations
(si elles sont connues) en 1999, 2010 et 2012 sous la forme de nombres
entiers. Là encore, cette représentation (une colonne par année) a des
inconvénients, notamment l'impossibilité d'ajouter de nouvelles données
lorsqu'elles seront disponibles. On réfléchira à d'autres solutions en XXX.</li>

<li>la colonne <code>area</code> contient la surface de la ville en km² sous la forme d'un
nombre à virgule flottante en double précision.</li>

<li>les colonnes <code>longitude</code> et <code>latitude</code> contiennent les longitude et latitude
en degrés sous la forme de nombres à virgule flottante double précision. Cette
colonne interdit les valeurs manquantes (<code>NULL</code>).</li>

<li>les colonnes <code>z_min</code> et <code>z_max</code> contiennent, lorsqu'elles sont disponibles,
les altitudes minimales et maximales de la ville, sous la forme de nombres
entiers de mètres.</li>
</ul>


<p>
Si une table avec le nom utilisé dans la commande <code>CREATE TABLE</code>
existe déjà, la création échoue.
</p>

<p>
On remarque la correspondance de l'<i>ORM</i> (Object-Relational Mapping) entre
classes et tables et entre colonnes et attributs (et donc entre lignes et
objets). On note les différences suivantes :
</p>

<ul class="org-ul">
<li>la notion de <i>clé primaire</i> qui est nécessaire, en plus des colonnes pour les
attributs, afin de gérer l'identité des enregistrements.</li>
<li>le fait qu'en plus d'avoir des types, les colonnes peuvent avoir des
contraintes, notamment :
<ul class="org-ul">
<li>sur chaque valeur, par exemple le fait de pouvoir être une valeur manquante
ou non, ou sur le domaine de validité (par exemple le fait d'être
une valeur positive).</li>
<li>sur l'ensemble des valeurs d'une colonne, par exemple la contrainte
d'unicité (implicite pour les clés primaires).</li>
<li>sur plusieurs colonnes, par exemple le fait qu'une valeur doive être
inférieure ou supérieure à une autre. Il est possible, et même recommandé,
de <a href="https://en.wikipedia.org/wiki/Check_constraint">nommer les contraintes</a>, afin d'avoir des messages d'erreur plus
explicites. Attention ! <a href="https://dev.mysql.com/doc/refman/5.7/en/create-table.html">Certaines bases de données ignorent les contraintes
de type CHECK</a> !</li>
</ul></li>
<li>le fait que les chaînes de caractères sont le plus souvent implémentées avec
une taille maximale prédéterminée (pour des raisons de performance). En fait,
certains systèmes de gestion de bases de données proposent un type <code>text</code>
pour stocker des chaînes de caractères sans limite de taille à priori, mais
ce n'est pas un type du standard SQL.</li>
</ul>

<p>
Au niveau des chaînes de caractères, contrairement à Java, il y a <a href="https://www.postgresql.org/docs/current/static/multibyte.html">plusieurs
possibilités d'encodage</a>. On s'assurera en général d'utiliser le plus standard :
UTF-8.
</p>

<p>
À titre d'exercice, on peut créer d'autres tables, par exemple avec des contraintes nommées.
</p>
</div>
</div>
