session2/cours/sgdbr.md


<a id="org18be0e2"></a>

# Création de la table cities

En fait, on va créer la table `cities` sur le serveur Postgresql distant à partir d'une sélection des colonnes d'une table d'une base de données existante. La table source sera sur le serveur MySQL distant hébergé gratuitement à `jdbc:mysql://db4free.net:3306/random_user` avec les login est mot de passe : `random_user` et `1mot2passe`, à partir des donnés mises à disposition par [données mises à disposition par Tony Archambeau](http://sql.sh/736-base-donnees-villes-francaises).

La table destination sera sur le serveur Postgresql distant vu plus haut XXX.

On va créer la table city sur le serveur postgresql avec la commande SQL suivante :

```sql
      CREATE TABLE cities (
      id SERIAL PRIMARY KEY,
      name VARCHAR(255) NOT NULL,
      departement VARCHAR(3),
      postal_codes VARCHAR(255),
      pop_1999 INTEGER CHECK (pop_1999 >= 0),
      pop_2010 INTEGER CHECK (pop_2010 >= 0),
      pop_2012 INTEGER CHECK (pop_2012 >= 0),
      area DOUBLE PRECISION  CHECK (area >= 0.),
      longitude DOUBLE PRECISION NOT NULL,
      latitude DOUBLE PRECISION NOT NULL,
      z_min INTEGER,
      z_max INTEGER,
      CHECK (z_min <= z_max));
```

-   La colonne `id` est une clé primaire (*PRIMARY KEY*) qui permet donc l'identification de chaque ligne de la table. On laissera la base de données attribuer une valeur unique à chaque nouvelle ligne ajoutée à la table (on mettra `DEFAULT` en valeur). On indique à la base d'utiliser des valeurs entières successives (`SERIAL`). La base de donnée s'assure que les valeurs des identifiants sont uniques dans la table : deux lignes ne peuvent pas avoir la même valeur de clé primaire. De plus, comme la recherche d'une ligne à partir de la valeur de son identifiant doit être très rapide, la clé primaire est automatiquement associée à un *index* qui permet d'accélérer les recherches.

-   La colonne `name` contiendra une chaîne d'au maximum 255 caractères et n'autorise pas de valeur manquante (`NULL`).

-   La colonne `departement` contiendra une chaîne d'au maximum 3 caractères pour le code du département de la ville.

-   la colonne `postal_codes` contiendra une chaîne d'au maximum 255 caractères pour stocker le ou les codes postaux de la ville. En cas de plusieurs codes postaux, ceux-ci sont séparés par le caractère '-'. Ce n'est pas la représentation la plus pratique d'une liste, et nous verrons en XXX d'autres solutions.

-   les colonnes `pop_1999`, `pop_2010` et `pop_2012` contiennent les populations (si elles sont connues) en 1999, 2010 et 2012 sous la forme de nombres entiers. Là encore, cette représentation (une colonne par année) a des inconvénients, notamment l'impossibilité d'ajouter de nouvelles données lorsqu'elles seront disponibles. On réfléchira à d'autres solutions en XXX.

-   la colonne `area` contient la surface de la ville en km² sous la forme d'un nombre à virgule flottante en double précision.

-   les colonnes `longitude` et `latitude` contiennent les longitude et latitude en degrés sous la forme de nombres à virgule flottante double précision. Cette colonne interdit les valeurs manquantes (`NULL`).

-   les colonnes `z_min` et `z_max` contiennent, lorsqu'elles sont disponibles, les altitudes minimales et maximales de la ville, sous la forme de nombres entiers de mètres.

Si une table avec le nom utilisé dans la commande `CREATE TABLE` existe déjà, la création échoue.

On remarque la correspondance de l'*ORM* (Object-Relational Mapping) entre classes et tables et entre colonnes et attributs (et donc entre lignes et objets). On note les différences suivantes :

-   la notion de *clé primaire* qui est nécessaire, en plus des colonnes pour les attributs, afin de gérer l'identité des enregistrements.
-   le fait qu'en plus d'avoir des types, les colonnes peuvent avoir des contraintes, notamment :
    -   sur chaque valeur, par exemple le fait de pouvoir être une valeur manquante ou non, ou sur le domaine de validité (par exemple le fait d'être une valeur positive).
    -   sur l'ensemble des valeurs d'une colonne, par exemple la contrainte d'unicité (implicite pour les clés primaires).
    -   sur plusieurs colonnes, par exemple le fait qu'une valeur doive être inférieure ou supérieure à une autre. Il est possible, et même recommandé, de [nommer les contraintes](https://en.wikipedia.org/wiki/Check_constraint), afin d'avoir des messages d'erreur plus explicites. Attention ! [Certaines bases de données ignorent les contraintes de type CHECK](https://dev.mysql.com/doc/refman/5.7/en/create-table.html) !
-   le fait que les chaînes de caractères sont le plus souvent implémentées avec une taille maximale prédéterminée (pour des raisons de performance). En fait, certains systèmes de gestion de bases de données proposent un type `text` pour stocker des chaînes de caractères sans limite de taille à priori, mais ce n'est pas un type du standard SQL.

Au niveau des chaînes de caractères, contrairement à Java, il y a [plusieurs possibilités d'encodage](https://www.postgresql.org/docs/current/static/multibyte.html). On s'assurera en général d'utiliser le plus standard : UTF-8.

À titre d'exercice, on peut créer d'autres tables, par exemple avec des contraintes nommées.
