session2/cours/sgdbr.html

<div id="outline-container-org355b2dc" class="outline-2">
<h2 id="org355b2dc"><span class="section-number-2">4</span> Destruction de table</h2>
<div class="outline-text-2" id="text-4">
<p>
On peut détruire une table avec l'instruction <code>DROP TABLE</code> :
</p>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #0000FF;">CREATE</span> <span style="color: #0000FF;">TABLE</span> <span style="color: #006699;">to_drop</span>(id SERIAL <span style="color: #0000FF;">PRIMARY</span> <span style="color: #0000FF;">KEY</span>);
<span style="color: #0000FF;">DROP</span> <span style="color: #0000FF;">TABLE</span> <span style="color: #006699;">to_drop</span>;
</pre>
</div>

<p>
<b>Attention !</b> Il y'a pas de possibilité de revenir en arrière sur l'effacement
d'une table. Bien s'assurer qu'on efface bien la table voulue (et qu'on est bien
sur le serveur de base de données voulu, pas sur le serveur de production plutôt
que sur celui de développement ou de test !).
</p>
</div>
</div>

<div id="outline-container-org81b1ed3" class="outline-2">
<h2 id="org81b1ed3"><span class="section-number-2">5</span> Insertions dans la table cities</h2>
<div class="outline-text-2" id="text-5">
<p>
On va ajouter une ville dans la base, par exemple le village disparu <a href="https://fr.wikipedia.org/wiki/Ailles">Ailles</a> avec
les informations suivantes :
</p>
<dl class="org-dl">
<dt>nom</dt><dd>Ailles</dd>
<dt>département</dt><dd>02</dd>
<dt>populations</dt><dd>0 pour toutes les années considérées</dd>
<dt>superficie</dt><dd>4.69 km²</dd>
<dt>longitude</dt><dd>4.1528</dd>
<dt>latitude</dt><dd>49.3493</dd>
</dl>

<div class="org-src-container">
<pre class="src src-sql"><span style="color: #0000FF;">INSERT</span> <span style="color: #0000FF;">INTO</span> cities <span style="color: #0000FF;">VALUES</span>(<span style="color: #0000FF;">DEFAULT</span>, <span style="color: #008000;">'Ailles'</span>, <span style="color: #008000;">'02'</span>, <span style="color: #0000FF;">NULL</span>, 0,0,0, 4.69, 4.1528, 49.3493, <span style="color: #0000FF;">NULL</span>, <span style="color: #0000FF;">NULL</span>);
</pre>
</div>


<p>
On peut vérifier qu'une tentative d'insertion de valeurs ne respectant pas les
contraintes est rejetée (sous réserve que l'on utilise pas
 <a href="https://dev.mysql.com/doc/refman/5.7/en/create-table.html">un SGDBR qui ignore certaines contraintes</a> :
</p>


<div class="org-src-container">
<pre class="src src-sql"><span style="color: #0000FF;">INSERT</span> <span style="color: #0000FF;">INTO</span> cities <span style="color: #0000FF;">VALUES</span>(<span style="color: #0000FF;">DEFAULT</span>, <span style="color: #008000;">'longitude invalide'</span>, <span style="color: #008000;">'02'</span>, <span style="color: #0000FF;">NULL</span>, 0,0,0, 4.69, <span style="color: #0000FF;">NULL</span>, 49.3493, <span style="color: #0000FF;">NULL</span>, <span style="color: #0000FF;">NULL</span>);
</pre>
</div>

<p>
À titre d'exercice, on peut vérifier l'erreur provoquée par la tentative
d'insertion d'une ligne dont le département est invalide, soit pour une erreur
de type, soit parce que la chaîne de caractères serait trop longue.
</p>

<div class="org-src-container">
<pre class="src src-sql"><span style="color: #0000FF;">INSERT</span> <span style="color: #0000FF;">INTO</span> cities <span style="color: #0000FF;">VALUES</span>(<span style="color: #0000FF;">DEFAULT</span>, <span style="color: #008000;">'pop invalide'</span>, <span style="color: #008000;">'02'</span>, <span style="color: #0000FF;">NULL</span>, -1,0,0, 4.69, 4.1528, 49.3493, <span style="color: #0000FF;">NULL</span>, <span style="color: #0000FF;">NULL</span>);
</pre>
</div>

<p>
et
</p>

<div class="org-src-container">
<pre class="src src-sql"><span style="color: #0000FF;">INSERT</span> <span style="color: #0000FF;">INTO</span> cities <span style="color: #0000FF;">VALUES</span>(<span style="color: #0000FF;">DEFAULT</span>, <span style="color: #008000;">'z invalides'</span>, <span style="color: #008000;">'02'</span>, <span style="color: #0000FF;">NULL</span>, 0,0,0, 4.69, 4.1528, 49.3493, 1, -1);
</pre>
</div>

<p>
Pour ces dernières contraintes, le message d'erreur sera plus ou moins explicite
selon qu'on aura ou non nommé la contrainte violée.
</p>


<p>
On va aussi ajouter des villes imaginaires afin de pouvoir faire des modifications sans invalider des données réelles :
</p>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #0000FF;">INSERT</span> <span style="color: #0000FF;">INTO</span> cities <span style="color: #0000FF;">VALUES</span>(<span style="color: #0000FF;">DEFAULT</span>, <span style="color: #008000;">'Ville d''en haut'</span>, <span style="color: #0000FF;">NULL</span>, <span style="color: #0000FF;">NULL</span>, 100, <span style="color: #0000FF;">NULL</span>, <span style="color: #0000FF;">NULL</span>, 4.69, 5.0, 50.0, <span style="color: #0000FF;">NULL</span>, <span style="color: #0000FF;">NULL</span>);
<span style="color: #0000FF;">INSERT</span> <span style="color: #0000FF;">INTO</span> cities <span style="color: #0000FF;">VALUES</span>(<span style="color: #0000FF;">DEFAULT</span>, <span style="color: #008000;">'Ville d''en bas'</span>, <span style="color: #0000FF;">NULL</span>, <span style="color: #0000FF;">NULL</span>, 100, <span style="color: #0000FF;">NULL</span>, <span style="color: #0000FF;">NULL</span>, 4.69, 5.0, 50.0, <span style="color: #0000FF;">NULL</span>, <span style="color: #0000FF;">NULL</span>);
</pre>
</div>
</div>
</div>

<div id="outline-container-org320e343" class="outline-2">
<h2 id="org320e343"><span class="section-number-2">6</span> Suppression</h2>
<div class="outline-text-2" id="text-6">
<p>
On peut supprimer la première ville que l'on a ajoutée de la façon suivante :
</p>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #0000FF;">DELETE</span> <span style="color: #0000FF;">FROM</span> cities <span style="color: #0000FF;">WHERE</span> <span style="color: #0000FF;">name</span>=<span style="color: #008000;">'Ailles'</span>;
</pre>
</div>

<p>
Attention, si la clause <code>WHERE</code> sélectionne plusieurs lignes, elles seront
toutes effacées. <b>Attention !</b> En l'abscence de clause <code>WHERE</code>, <b>TOUTES LES
LIGNES SERONT EFFACÉES !</b>
</p>

<p>
En pratique, il est souvent plus prudent de faire un <code>SELECT</code> avec la clause
<code>WHERE</code> pour s'assurer que l'on ne sélectionne pas plus de lignes que prévu.
Ensuite, on remplace le <code>SELECT</code> par un <code>DELETE</code> sans toucher à la clause
<code>WHERE</code> pour être sûr que ce sont bien les mêmes lignes qui seront effacées.
</p>
</div>
</div>
