session2/cours/sgdbr.md


<a id="orgb1d0228"></a>

# Destruction de table

On peut détruire une table avec l'instruction `DROP TABLE` :

```sql
CREATE TABLE to_drop(id SERIAL PRIMARY KEY);
DROP TABLE to_drop;
```

**Attention !** Il y'a pas de possibilité de revenir en arrière sur l'effacement d'une table. Bien s'assurer qu'on efface bien la table voulue (et qu'on est bien sur le serveur de base de données voulu, pas sur le serveur de production plutôt que sur celui de développement ou de test !).


<a id="org4ac2f09"></a>

# Insertions dans la table cities

On va ajouter une ville dans la base, par exemple le village disparu [Ailles](https://fr.wikipedia.org/wiki/Ailles) avec les informations suivantes :

-   **nom:** Ailles
-   **département:** 02
-   **populations:** 0 pour toutes les années considérées
-   **superficie:** 4.69 km²
-   **longitude:** 4.1528
-   **latitude:** 49.3493

```sql
INSERT INTO cities VALUES(DEFAULT, 'Ailles', '02', NULL, 0,0,0, 4.69, 4.1528, 49.3493, NULL, NULL);
```

On peut vérifier qu'une tentative d'insertion de valeurs ne respectant pas les contraintes est rejetée (sous réserve que l'on utilise pas [un SGDBR qui ignore certaines contraintes](https://dev.mysql.com/doc/refman/5.7/en/create-table.html) :

```sql
INSERT INTO cities VALUES(DEFAULT, 'longitude invalide', '02', NULL, 0,0,0, 4.69, NULL, 49.3493, NULL, NULL);
```

À titre d'exercice, on peut vérifier l'erreur provoquée par la tentative d'insertion d'une ligne dont le département est invalide, soit pour une erreur de type, soit parce que la chaîne de caractères serait trop longue.

```sql
INSERT INTO cities VALUES(DEFAULT, 'pop invalide', '02', NULL, -1,0,0, 4.69, 4.1528, 49.3493, NULL, NULL);
```

et

```sql
INSERT INTO cities VALUES(DEFAULT, 'z invalides', '02', NULL, 0,0,0, 4.69, 4.1528, 49.3493, 1, -1);
```

Pour ces dernières contraintes, le message d'erreur sera plus ou moins explicite selon qu'on aura ou non nommé la contrainte violée.

On va aussi ajouter des villes imaginaires afin de pouvoir faire des modifications sans invalider des données réelles :

```sql
INSERT INTO cities VALUES(DEFAULT, 'Ville d''en haut', NULL, NULL, 100, NULL, NULL, 4.69, 5.0, 50.0, NULL, NULL);
INSERT INTO cities VALUES(DEFAULT, 'Ville d''en bas', NULL, NULL, 100, NULL, NULL, 4.69, 5.0, 50.0, NULL, NULL);
```


<a id="orgeab42bf"></a>

# Suppression

On peut supprimer la première ville que l'on a ajoutée de la façon suivante :

```sql
DELETE FROM cities WHERE name='Ailles';
```

Attention, si la clause `WHERE` sélectionne plusieurs lignes, elles seront toutes effacées. **Attention !** En l'abscence de clause `WHERE`, **TOUTES LES LIGNES SERONT EFFACÉES !**

En pratique, il est souvent plus prudent de faire un `SELECT` avec la clause `WHERE` pour s'assurer que l'on ne sélectionne pas plus de lignes que prévu. Ensuite, on remplace le `SELECT` par un `DELETE` sans toucher à la clause `WHERE` pour être sûr que ce sont bien les mêmes lignes qui seront effacées.
