session2/cours/sgdbr.org
* Modification dans la table cities

Supposons que l'on veuille modifier les valeurs d'un ou plusieurs attributs, par
exemple pour modifier la valeur de la population en 2010 d'une ville que l'on a ajoutée :
#+BEGIN_SRC sql
UPDATE cities SET pop_2010= 1000 WHERE name='Ville d''en haut';
#+END_SRC
On peut bien sûr utiliser n'importe quelle expression pour la nouvelle valeur,
en utilisant éventuellement les valeurs de la ligne modifiée :

#+BEGIN_SRC sql
UPDATE cities SET pop_2010= pop_2010 + 0.5 * pop_1999 WHERE name='Ville d''en haut';
#+END_SRC

On peut aussi modifier plusieurs lignes à la fois lorsque la clause =WHERE= en sélectionne plus d'une :

#+BEGIN_SRC sql
UPDATE cities SET pop_2012= 2 * pop_1999 +1 WHERE name LIKE 'Ville d''en %';
#+END_SRC

*Attention !* En l'absence de clause =WHERE=, ce sont *toutes les lignes* de la table qui seront modifiées !

* Notion de transaction


On peut vouloir faire plusieurs modifications "en même temps", ou plus
exactement de façon atomique. C'est-à-dire que l'ensemble des modifications soit
effectué ou alors qu'aucune modification ne soit effectuée. On peut utiliser
pour cela une /transaction/. On commence explicitement une transaction avec
l'instruction SQL =START TRANSACTION= et ensuite, si tout c'est bien passé en enregistre les
résultats de la transaction avec l'instruction SQL =COMMIT=. En cas d'erreur, on
peut annuler tout ce qui a été fait depuis le début de la transaction avec
l'instruction =ROLLBACK=.

Attention ! La plupart des consoles permettant d'envoyer des commandes SQL à un
SGBDR sont en mode 'auto-commit' où chaque instruction est considérée comme
étant dans une transaction terminée par un commit. Pour tester les effets d'une
transaction explicite, il est nécessaire de désactiver l'auto-commit.

Par exemple, si l'on veut déplacer 75 personnes de la population de 'Ville d'en
haut' en 1999 vers la population de 'Ville d'en bas' la même année :
#+BEGIN_SRC sql
SELECT * from cities WHERE name LIKE '%Ville d''en %';
START TRANSACTION;
UPDATE cities SET pop_1999= pop_1999 + 75 WHERE name = 'Ville d''en bas';
UPDATE cities SET pop_1999= pop_1999 - 75 WHERE name = 'Ville d''en haut';
COMMIT;
SELECT * from cities WHERE name LIKE '%Ville d''en %';
#+END_SRC

Mais si l'on essaie répéter ces opérations une deuxième fois (pourvu que la
population de 'Ville d'en haut' soit trop faible et que les contraintes
d'intégrité soient honorées), la deuxième instruction sera rejetée :
#+BEGIN_SRC sql
SELECT * from cities WHERE name LIKE '%Ville d''en %';
START TRANSACTION;
UPDATE cities SET pop_1999= pop_1999 + 75 WHERE name = 'Ville d''en bas';
SELECT * from cities WHERE name LIKE '%Ville d''en %';
UPDATE cities SET pop_1999= pop_1999 - 75 WHERE name = 'Ville d''en haut';
#+END_SRC
On peut vérifier que la première a bien eu un effet avec une instruction
=SELECT=, mais on peut revenir en arrière sur cette modification à l'aide d'un =ROLLBACK= :
#+BEGIN_SRC sql
SELECT * from cities WHERE name LIKE '%Ville d''en %';
ROLLBACK;
SELECT * from cities WHERE name LIKE '%Ville d''en %';
#+END_SRC


Attention ! On pourrait être tenté de vouloir vérifier à l'avance si un ensemble
de modifications sera possible sans violations de contraintes. C'est cependant
impossible dans le contexte d'un *serveur* de bases de données. En effet, entre
l'instant où l'on vérifie une condition et celui où on effectue une modification
en fonction de cette condition, les données de la base peut avoir été modifiées
! La seule façon de savoir si une modification peut être faite sans violation de
contrainte, c'est d'essayer de faire la modification et de constater si elle a
pu être effectuée ou non. D'où la nécessité d'utiliser des transactions si
plusieurs modifications doivent être toutes effectuées ensemble ou aucune ne
doit être effectuée si l'une d'elles échoue.



