session2/cours/sgdbr.html


<div id="outline-container-org742ed79" class="outline-2">
<h2 id="org742ed79"><span class="section-number-2">7</span> Modification dans la table cities</h2>
<div class="outline-text-2" id="text-7">
<p>
Supposons que l'on veuille modifier les valeurs d'un ou plusieurs attributs, par
exemple pour modifier la valeur de la population en 2010 d'une ville que l'on a ajoutée :
</p>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #0000FF;">UPDATE</span> cities <span style="color: #0000FF;">SET</span> pop_2010= 1000 <span style="color: #0000FF;">WHERE</span> <span style="color: #0000FF;">name</span>=<span style="color: #008000;">'Ville d''en haut'</span>;
</pre>
</div>
<p>
On peut bien sûr utiliser n'importe quelle expression pour la nouvelle valeur,
en utilisant éventuellement les valeurs de la ligne modifiée :
</p>

<div class="org-src-container">
<pre class="src src-sql"><span style="color: #0000FF;">UPDATE</span> cities <span style="color: #0000FF;">SET</span> pop_2010= pop_2010 + 0.5 * pop_1999 <span style="color: #0000FF;">WHERE</span> <span style="color: #0000FF;">name</span>=<span style="color: #008000;">'Ville d''en haut'</span>;
</pre>
</div>

<p>
On peut aussi modifier plusieurs lignes à la fois lorsque la clause <code>WHERE</code> en sélectionne plus d'une :
</p>

<div class="org-src-container">
<pre class="src src-sql"><span style="color: #0000FF;">UPDATE</span> cities <span style="color: #0000FF;">SET</span> pop_2012= 2 * pop_1999 +1 <span style="color: #0000FF;">WHERE</span> <span style="color: #0000FF;">name</span> <span style="color: #0000FF;">LIKE</span> <span style="color: #008000;">'Ville d''en %'</span>;
</pre>
</div>

<p>
<b>Attention !</b> En l'absence de clause <code>WHERE</code>, ce sont <b>toutes les lignes</b> de la table qui seront modifiées !
</p>
</div>
</div>

<div id="outline-container-org5cc8a75" class="outline-2">
<h2 id="org5cc8a75"><span class="section-number-2">8</span> Notion de transaction</h2>
<div class="outline-text-2" id="text-8">
<p>
On peut vouloir faire plusieurs modifications "en même temps", ou plus
exactement de façon atomique. C'est-à-dire que l'ensemble des modifications soit
effectué ou alors qu'aucune modification ne soit effectuée. On peut utiliser
pour cela une <i>transaction</i>. On commence explicitement une transaction avec
l'instruction SQL <code>START TRANSACTION</code> et ensuite, si tout c'est bien passé en enregistre les
résultats de la transaction avec l'instruction SQL <code>COMMIT</code>. En cas d'erreur, on
peut annuler tout ce qui a été fait depuis le début de la transaction avec
l'instruction <code>ROLLBACK</code>.
</p>

<p>
Attention ! La plupart des consoles permettant d'envoyer des commandes SQL à un
SGBDR sont en mode 'auto-commit' où chaque instruction est considérée comme
étant dans une transaction terminée par un commit. Pour tester les effets d'une
transaction explicite, il est nécessaire de désactiver l'auto-commit.
</p>

<p>
Par exemple, si l'on veut déplacer 75 personnes de la population de 'Ville d'en
haut' en 1999 vers la population de 'Ville d'en bas' la même année :
</p>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #0000FF;">SELECT</span> * <span style="color: #0000FF;">from</span> cities <span style="color: #0000FF;">WHERE</span> <span style="color: #0000FF;">name</span> <span style="color: #0000FF;">LIKE</span> <span style="color: #008000;">'%Ville d''en %'</span>;
<span style="color: #0000FF;">START</span> <span style="color: #0000FF;">TRANSACTION</span>;
<span style="color: #0000FF;">UPDATE</span> cities <span style="color: #0000FF;">SET</span> pop_1999= pop_1999 + 75 <span style="color: #0000FF;">WHERE</span> <span style="color: #0000FF;">name</span> = <span style="color: #008000;">'Ville d''en bas'</span>;
<span style="color: #0000FF;">UPDATE</span> cities <span style="color: #0000FF;">SET</span> pop_1999= pop_1999 - 75 <span style="color: #0000FF;">WHERE</span> <span style="color: #0000FF;">name</span> = <span style="color: #008000;">'Ville d''en haut'</span>;
<span style="color: #0000FF;">COMMIT</span>;
<span style="color: #0000FF;">SELECT</span> * <span style="color: #0000FF;">from</span> cities <span style="color: #0000FF;">WHERE</span> <span style="color: #0000FF;">name</span> <span style="color: #0000FF;">LIKE</span> <span style="color: #008000;">'%Ville d''en %'</span>;
</pre>
</div>

<p>
Mais si l'on essaie répéter ces opérations une deuxième fois (pourvu que la
population de 'Ville d'en haut' soit trop faible et que les contraintes
d'intégrité soient honorées), la deuxième instruction sera rejetée :
</p>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #0000FF;">SELECT</span> * <span style="color: #0000FF;">from</span> cities <span style="color: #0000FF;">WHERE</span> <span style="color: #0000FF;">name</span> <span style="color: #0000FF;">LIKE</span> <span style="color: #008000;">'%Ville d''en %'</span>;
<span style="color: #0000FF;">START</span> <span style="color: #0000FF;">TRANSACTION</span>;
<span style="color: #0000FF;">UPDATE</span> cities <span style="color: #0000FF;">SET</span> pop_1999= pop_1999 + 75 <span style="color: #0000FF;">WHERE</span> <span style="color: #0000FF;">name</span> = <span style="color: #008000;">'Ville d''en bas'</span>;
<span style="color: #0000FF;">SELECT</span> * <span style="color: #0000FF;">from</span> cities <span style="color: #0000FF;">WHERE</span> <span style="color: #0000FF;">name</span> <span style="color: #0000FF;">LIKE</span> <span style="color: #008000;">'%Ville d''en %'</span>;
<span style="color: #0000FF;">UPDATE</span> cities <span style="color: #0000FF;">SET</span> pop_1999= pop_1999 - 75 <span style="color: #0000FF;">WHERE</span> <span style="color: #0000FF;">name</span> = <span style="color: #008000;">'Ville d''en haut'</span>;
</pre>
</div>
<p>
On peut vérifier que la première a bien eu un effet avec une instruction
<code>SELECT</code>, mais on peut revenir en arrière sur cette modification à l'aide d'un <code>ROLLBACK</code> :
</p>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #0000FF;">SELECT</span> * <span style="color: #0000FF;">from</span> cities <span style="color: #0000FF;">WHERE</span> <span style="color: #0000FF;">name</span> <span style="color: #0000FF;">LIKE</span> <span style="color: #008000;">'%Ville d''en %'</span>;
<span style="color: #0000FF;">ROLLBACK</span>;
<span style="color: #0000FF;">SELECT</span> * <span style="color: #0000FF;">from</span> cities <span style="color: #0000FF;">WHERE</span> <span style="color: #0000FF;">name</span> <span style="color: #0000FF;">LIKE</span> <span style="color: #008000;">'%Ville d''en %'</span>;
</pre>
</div>


<p>
Attention ! On pourrait être tenté de vouloir vérifier à l'avance si un ensemble
de modifications sera possible sans violations de contraintes. C'est cependant
impossible dans le contexte d'un <b>serveur</b> de bases de données. En effet, entre
l'instant où l'on vérifie une condition et celui où on effectue une modification
en fonction de cette condition, les données de la base peut avoir été modifiées
! La seule façon de savoir si une modification peut être faite sans violation de
contrainte, c'est d'essayer de faire la modification et de constater si elle a
pu être effectuée ou non. D'où la nécessité d'utiliser des transactions si
plusieurs modifications doivent être toutes effectuées ensemble ou aucune ne
doit être effectuée si l'une d'elles échoue.
</p>
</div>
</div>
