session2/cours/sgdbr.html



<div id="outline-container-org95e7502" class="outline-2">
<h2 id="org95e7502"><span class="section-number-2">9</span> Utilisation de SGBDR en Java : préliminaires</h2>
<div class="outline-text-2" id="text-9">
<p>
Les SGDBR et leurs drivers Java permettent différents niveaux de
fonctionnalités. Dans un soucis de simplicité et de compatibilité maximale, on
ne s'intéresse ici qu'aux fonctionnalités les plus basiques dont la
disponibilité est garantie. En cas de besoin, et si le SGDBR est connu et fixé,
on pourra utiliser <a href="https://docs.oracle.com/javase/tutorial/jdbc/basics/retrieving.html">des fonctionnalités plus avancées</a>.
</p>
</div>

<div id="outline-container-orga22d5d0" class="outline-3">
<h3 id="orga22d5d0"><span class="section-number-3">9.1</span> Chargement de drivers</h3>
<div class="outline-text-3" id="text-9-1">
<p>
Tout d'abord, il faut utiliser le(s) driver(s) JDBC (Java DataBase Connectivity)
adapté(s) au(x) SGBDR utilisé(s).
</p>

<p>
Ensuite, il faut rendre les drivers accessibles au programme Java.
Habituellement, il suffit d'utiliser <code>import</code> pour utiliser n'importe quelle
classe (sous réserve qu'elle soit disponible dans le <code>CLASSPATH</code> lors de la
compilation et de l'exécution du programme.
</p>

<p>
Dans le cas des classes de drivers JDBC, on veut pouvoir choisir le SGDBR, et
donc le driver, à l'exécution et non à la compilation. En effet, on peut vouloir
utiliser différents SGDBR en environnement de test et en production. Évidemment,
il faut que ce soit le même programme compilé qui soit exécuté en test et en
production. Pour la même raison, parce que les URL d'accès au SGBDR et les
comptes (login et mot de passe associé) ne sont pas forcément les mêmes en test
et en production, on fera aussi en sorte que ces informations soient aussi
paramétrables sans recompilation, donc hors du code source.
</p>

<p>
En fait, pour les mots de passe, il est aussi essentiel de ne jamais les écrire
dans un code source. En effet, les codes sources sont souvent diffusés
largement, notamment par des systèmes de gestion de version et doivent donc
contenir aucune information confidentielle. Par exemple, lorsqu'on stocke des
informations confidentielles dans un fichier .properties dans un projet géré par
git, il est essentiel d'exclure ce fichier de la gestion de version à l'aide de
<a href="https://git-scm.com/docs/gitignore">gitignore</a>.
</p>


<p>
Pour que les classes des drivers JDBC soient chargées dynamiquement (à
l'exécution), il faut exécuter la méthode statique <code>forName</code> de la classe <a href="https://docs.oracle.com/javase/8/docs/api/java/lang/Class.html">Class</a>  :
</p>

<ul class="org-ul">
<li>pour Postgresql :</li>
</ul>
<div class="org-src-container">
<pre class="src src-java">Class.forName(<span style="color: #008000;">"org.postgresql.Driver"</span>);
</pre>
</div>
<ul class="org-ul">
<li>pour H2 :</li>
</ul>
<div class="org-src-container">
<pre class="src src-java">Class.forName(<span style="color: #008000;">"org.h2.Driver"</span>);
</pre>
</div>
<ul class="org-ul">
<li>pour MySQL :</li>
</ul>
<div class="org-src-container">
<pre class="src src-java">Class.forName(<span style="color: #008000;">"com.mysql.jdbc.Driver"</span>);
</pre>
</div>

<p>
Cet appel de méthode peut lancer une exception de type <code>ClassNotFoundException</code>
qu'il faut donc gérer.
</p>

<p>
Ensuite, le driver correspondant au SGBDR sera choisi en fonction de l'URL de
connection à la base. Cette URL étant dans une chaîne de caractères, elle est
donc aussi configurable à l'exécution.
</p>
</div>
</div>

<div id="outline-container-orgdbb0b48" class="outline-3">
<h3 id="orgdbb0b48"><span class="section-number-3">9.2</span> Établissement de la connection au SGBDR</h3>
<div class="outline-text-3" id="text-9-2">
<p>
La connection au SGDBR est matérialisée par un objet instance d'une classe
implémentant l'interface <a href="https://docs.oracle.com/javase/7/docs/api/java/sql/Connection.html">java.sql.Connection</a> . Cette connection peut être en
<a href="https://docs.oracle.com/javase/7/docs/api/java/sql/Connection.html#getAutoCommit()">mode autocommit ou non</a>. On récupère cet objet par un appel à la méthode
<a href="https://docs.oracle.com/javase/7/docs/api/java/sql/DriverManager.html#getConnection(java.lang.String,%20java.lang.String,%20java.lang.String)">java.sql.DriverManager.getConnection()</a>. Par exemple, si les URL, login et mot de
passe sont stockés dans une <code>Map&lt;String,String&gt; env</code> et assocés aux clés <code>"URL"</code>, <code>"USER"</code> et <code>"PASS"</code> :
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #6434A3;">Connection</span> <span style="color: #BA36A5;">conn</span>= DriverManager.getConnection(env.get(<span style="color: #008000;">"URL"</span>), env.get(<span style="color: #008000;">"USER"</span>), env.get(<span style="color: #008000;">"PASS"</span>));
</pre>
</div>

<p>
L'url étant de la forme "jdbc:SGBD_NAME://DBSERVER_NAME:DBSERVER_PORT/DATABASE_NAME".
</p>

<p>
Il faudra s'assurer que la connection sera fermée à un appel à la méthode
<a href="https://docs.oracle.com/javase/7/docs/api/java/sql/Connection.html#close()">close()</a>. On remarque que l'interface <code>java.sql.Connection</code> hérite de l'interface
<code>java.lang.AutoClosable</code>, ce qui implique donc qu'on peut faire l'initialisation
dans un bloc <code>try(){}</code> (dit «try with resources»). Attention : cette méthode
<code>.close()</code> peut elle-même lancer une <a href="https://docs.oracle.com/javase/7/docs/api/java/sql/SQLException.html">SQLException</a> qu'il faut donc aussi gérer.
</p>

<p>
On passera l'objet connection aux différentes méthodes qui s'en serviront pour
interagir avec le SGBDR.
</p>
</div>
</div>
</div>

<div id="outline-container-org635d3f3" class="outline-2">
<h2 id="org635d3f3"><span class="section-number-2">10</span> Utilisation de SGBDR en Java : requêtes SQL</h2>
<div class="outline-text-2" id="text-10">
<p>
Il y a deux façons de faire exécuter des requêtes SQL en Java, suivant qu'on
utilise des <a href="https://docs.oracle.com/javase/7/docs/api/java/sql/Statement.html">java.sql.Statement</a> ou des <a href="https://docs.oracle.com/javase/7/docs/api/java/sql/Statement.html">java.sql.PreparedStatement</a>.
</p>
</div>
