session2/cours/sgdbr.md


<a id="org0cd79a4"></a>

# Utilisation de SGBDR en Java : préliminaires

Les SGDBR et leurs drivers Java permettent différents niveaux de fonctionnalités. Dans un soucis de simplicité et de compatibilité maximale, on ne s'intéresse ici qu'aux fonctionnalités les plus basiques dont la disponibilité est garantie. En cas de besoin, et si le SGDBR est connu et fixé, on pourra utiliser [des fonctionnalités plus avancées](https://docs.oracle.com/javase/tutorial/jdbc/basics/retrieving.html).


<a id="org3463919"></a>

## Chargement de drivers

Tout d'abord, il faut utiliser le(s) driver(s) JDBC (Java DataBase Connectivity) adapté(s) au(x) SGBDR utilisé(s).

Ensuite, il faut rendre les drivers accessibles au programme Java. Habituellement, il suffit d'utiliser `import` pour utiliser n'importe quelle classe (sous réserve qu'elle soit disponible dans le `CLASSPATH` lors de la compilation et de l'exécution du programme.

Dans le cas des classes de drivers JDBC, on veut pouvoir choisir le SGDBR, et donc le driver, à l'exécution et non à la compilation. En effet, on peut vouloir utiliser différents SGDBR en environnement de test et en production. Évidemment, il faut que ce soit le même programme compilé qui soit exécuté en test et en production. Pour la même raison, parce que les URL d'accès au SGBDR et les comptes (login et mot de passe associé) ne sont pas forcément les mêmes en test et en production, on fera aussi en sorte que ces informations soient aussi paramétrables sans recompilation, donc hors du code source.

En fait, pour les mots de passe, il est aussi essentiel de ne jamais les écrire dans un code source. En effet, les codes sources sont souvent diffusés largement, notamment par des systèmes de gestion de version et doivent donc contenir aucune information confidentielle. Par exemple, lorsqu'on stocke des informations confidentielles dans un fichier .properties dans un projet géré par git, il est essentiel d'exclure ce fichier de la gestion de version à l'aide de [gitignore](https://git-scm.com/docs/gitignore).

Pour que les classes des drivers JDBC soient chargées dynamiquement (à l'exécution), il faut exécuter la méthode statique `forName` de la classe [Class](https://docs.oracle.com/javase/8/docs/api/java/lang/Class.html) :

-   pour Postgresql :

```java
Class.forName("org.postgresql.Driver");
```

-   pour H2 :

```java
Class.forName("org.h2.Driver");
```

-   pour MySQL :

```java
Class.forName("com.mysql.jdbc.Driver");
```

Cet appel de méthode peut lancer une exception de type `ClassNotFoundException` qu'il faut donc gérer.

Ensuite, le driver correspondant au SGBDR sera choisi en fonction de l'URL de connection à la base. Cette URL étant dans une chaîne de caractères, elle est donc aussi configurable à l'exécution.


<a id="org82c832f"></a>

## Établissement de la connection au SGBDR

La connection au SGDBR est matérialisée par un objet instance d'une classe implémentant l'interface [java.sql.Connection](https://docs.oracle.com/javase/7/docs/api/java/sql/Connection.html) . Cette connection peut être en [mode autocommit ou non](https://docs.oracle.com/javase/7/docs/api/java/sql/Connection.html#getAutoCommit()). On récupère cet objet par un appel à la méthode [java.sql.DriverManager.getConnection()](https://docs.oracle.com/javase/7/docs/api/java/sql/DriverManager.html#getConnection(java.lang.String,%20java.lang.String,%20java.lang.String)). Par exemple, si les URL, login et mot de passe sont stockés dans une `Map<String,String> env` et assocés aux clés `"URL"`, `"USER"` et `"PASS"` :

```java
Connection conn= DriverManager.getConnection(env.get("URL"), env.get("USER"), env.get("PASS"));
```

L'url étant de la forme "jdbc:SGBD\_NAME://DBSERVER\_NAME:DBSERVER\_PORT/DATABASE\_NAME".

Il faudra s'assurer que la connection sera fermée à un appel à la méthode [close()](https://docs.oracle.com/javase/7/docs/api/java/sql/Connection.html#close()). On remarque que l'interface `java.sql.Connection` hérite de l'interface `java.lang.AutoClosable`, ce qui implique donc qu'on peut faire l'initialisation dans un bloc `try(){}` (dit «try with resources»). Attention : cette méthode `.close()` peut elle-même lancer une [SQLException](https://docs.oracle.com/javase/7/docs/api/java/sql/SQLException.html) qu'il faut donc aussi gérer.

On passera l'objet connection aux différentes méthodes qui s'en serviront pour interagir avec le SGBDR.


<a id="org6f81d61"></a>

# Utilisation de SGBDR en Java : requêtes SQL

Il y a deux façons de faire exécuter des requêtes SQL en Java, suivant qu'on utilise des [java.sql.Statement](https://docs.oracle.com/javase/7/docs/api/java/sql/Statement.html) ou des [java.sql.PreparedStatement](https://docs.oracle.com/javase/7/docs/api/java/sql/Statement.html).
