session2/cours/sgdbr.md


<a id="org8907e01"></a>

## java.sql.PreparedStatement

Toujours à partir de l'objet implémentant l'interface [java.sql.Connection](https://docs.oracle.com/javase/7/docs/api/java/sql/Connection.html), on peut utiliser la méthode [prepareStatement(String sql)](https://docs.oracle.com/javase/7/docs/api/java/sql/Connection.html#prepareStatement(java.lang.String)) pour créer un objet implémentant l'interface [java.sql.PreparedStatement](https://docs.oracle.com/javase/7/docs/api/java/sql/PreparedStatement.html). La chaîne de caractère passée en argument contient le code de la commande SQL avec des '?' à la place des arguments de la commande. Par exemple, pour insérer une nouvelle ligne dans notre table `cities`, on pourra utiliser :

```java
String insertCmd= "INSERT INTO cities VALUES(DEFAULT, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?);";
try(PreparedStatement stmt= conn.prepareStatement(insertCmd)){
}
```

Comme pour la création d'un [java.sql.Statement](https://docs.oracle.com/javase/7/docs/api/java/sql/Statement.html), on peut (devrait ?) utiliser un *try with resources* parce que l'objet créé implémente l'interface `java.lang.AutoCloseable`.

Ensuite, on peut utiliser sur cet objet les méthodes `setXXX()` comme [setDouble(int parameterIndex, double parameterValue)](https://docs.oracle.com/javase/7/docs/api/java/sql/PreparedStatement.html#setDouble(int,%20double)) ou [setString(int parameterIndex, String parameterValue)](https://docs.oracle.com/javase/7/docs/api/java/sql/PreparedStatement.html#setString(int,%20java.lang.String)) pour donner des valeurs à chacun des paramètres représentés par un '?' dans la chaîne passée en argument de [prepareStatement(String sql)](https://docs.oracle.com/javase/7/docs/api/java/sql/Connection.html#prepareStatement(java.lang.String)). Attention ! Les `parameterIndex` commencent à 1 et non à 0. Si l'on veut insérer une valeur manquante `NULL`, il faut utiliser la méthode [setNull(int parameterIndex, int sqlType)](https://docs.oracle.com/javase/7/docs/api/java/sql/PreparedStatement.html#setNull(int,%20int)). L'argument `sqlType` étant l'une des constantes nommées définies dans la classe [java.sql.Types](https://docs.oracle.com/javase/7/docs/api/java/sql/Types.html).

Ensuite, une fois que tous les arguments on reçu une valeur, on peut appeler l'une des méthodes [execute()](https://docs.oracle.com/javase/7/docs/api/java/sql/PreparedStatement.html#execute()), [executeQuery()](https://docs.oracle.com/javase/7/docs/api/java/sql/PreparedStatement.html#executeQuery()) ou [executeUpdate()](https://docs.oracle.com/javase/7/docs/api/java/sql/PreparedStatement.html#executeUpdate()). On peut aussi créer un batch de plusieurs commandes à executer à l'aide des méthodes [addBatch()](https://docs.oracle.com/javase/7/docs/api/java/sql/PreparedStatement.html#addBatch()) et [executeBatch()](https://docs.oracle.com/javase/7/docs/api/java/sql/Statement.html#executeBatch()).
