session2/cours/sgdbr.html


<div id="outline-container-org55a5876" class="outline-3">
<h3 id="org55a5876"><span class="section-number-3">10.3</span> Lecture des résultats d'une requête SELECT</h3>
<div class="outline-text-3" id="text-10-3">
<p>
Lorsque l'on exécute une requête <code>SELECT</code>, on utilise la méthode <a href="https://docs.oracle.com/javase/7/docs/api/java/sql/PreparedStatement.html#executeQuery()">executeQuery()</a>
qui retourne un objet implémentant l'interface <a href="https://docs.oracle.com/javase/7/docs/api/java/sql/ResultSet.html">java.sql.ResultSet</a>. Cet objet
permet de récupérer chacunes des données de chacune des lignes correspondant à
la requête. Pour passer à la ligne suivante en testant s'il y en a une, on
utilise la méthode <a href="https://docs.oracle.com/javase/7/docs/api/java/sql/ResultSet.html#next()">next()</a> (le plus souvent comme condition de continuation dans
une boucle <code>while()</code> pour traiter toutes les lignes de la première à la
dernière). Ensuite, pour chacune des lignes (à l'intérieur de la boucle, donc),
on peut récupérer la valeur de chacune des colonnes avec des appels aux méthodes
<a href="https://docs.oracle.com/javase/7/docs/api/java/sql/ResultSet.html#getDouble(java.lang.String)">getDouble(String colName)</a>, <a href="https://docs.oracle.com/javase/7/docs/api/java/sql/ResultSet.html#getInt(java.lang.String)">getInt(String colName)</a>, <a href="https://docs.oracle.com/javase/7/docs/api/java/sql/ResultSet.html#getLong(java.lang.String)">getLong(String colName)</a>,
<a href="https://docs.oracle.com/javase/7/docs/api/java/sql/ResultSet.html#getString(java.lang.String)">getString(String colName)</a> et autres. Il est aussi possible de passer des numéros
de colonne en argument plutôt que d'utiliser les noms, mais il faut alors se
souvenir non seulement de l'ordre des colonnes dans le resultat, mais aussi que
leur numérotation commence à 1 et non à 0. Toujours dans un soucis de plus
grande compatibilité avec tous les drivers JDBC disponibles, mais aussi dans un
soucis de performance, il est préférable de se contenter de lire les lignes les
unes après les autres et pour chaque ligne et de ne lire les données qu'une
seule fois pour une instance de <code>ResultSet</code> donnée.
</p>

<p>
Par exemple, pour construire une liste d'objets de classe <code>CityDTO</code> à partir du
résultat d'une requête SQL sur une connection donnée, on pourrait écrire :
</p>
<div class="org-src-container">
<pre class="src src-java">        <span style="color: #0000FF;">private</span> <span style="color: #0000FF;">static</span> <span style="color: #6434A3;">List</span>&lt;<span style="color: #6434A3;">CityDTO</span>&gt; <span style="color: #006699;">readValues</span>(<span style="color: #6434A3;">Connection</span> <span style="color: #BA36A5;">conn</span>){
            <span style="color: #6434A3;">List</span>&lt;<span style="color: #6434A3;">CityDTO</span>&gt; <span style="color: #BA36A5;">res</span>= <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">ArrayList</span>&lt;<span style="color: #6434A3;">CityDTO</span>&gt;();
            <span style="color: #0000FF;">try</span>(<span style="color: #6434A3;">Statement</span> <span style="color: #BA36A5;">stmt</span>= conn.createStatement()){
                <span style="color: #6434A3;">ResultSet</span> <span style="color: #BA36A5;">rs</span>= stmt.executeQuery(readQuery);
                <span style="color: #0000FF;">while</span>(rs.next()){
                    <span style="color: #0000FF;">try</span> {
                    <span style="color: #6434A3;">Float</span> <span style="color: #BA36A5;">villeSurface</span> = (<span style="color: #6434A3;">Float</span>) rs.getObject(<span style="color: #008000;">"ville_surface"</span>);

                        res.add(<span style="color: #0000FF;">new</span> <span style="color: #6434A3;">CityDTO</span>(rs.getString(<span style="color: #008000;">"ville_nom_reel"</span>)
                                            , rs.getString(<span style="color: #008000;">"ville_departement"</span>)
                                            , rs.getString(<span style="color: #008000;">"ville_code_postal"</span>)
                                            , (<span style="color: #6434A3;">Integer</span>)rs.getObject(<span style="color: #008000;">"ville_population_1999"</span>)
                                            , (<span style="color: #6434A3;">Integer</span>)rs.getObject(<span style="color: #008000;">"ville_population_2010"</span>)
                                            , (<span style="color: #6434A3;">Integer</span>)rs.getObject(<span style="color: #008000;">"ville_population_2012"</span>)
                                            , villeSurface == <span style="color: #D0372D;">null</span> ? (Double) <span style="color: #D0372D;">null</span> : <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">Double</span>(villeSurface.doubleValue())
                                            , rs.getDouble(<span style="color: #008000;">"ville_longitude_deg"</span>)
                                            , rs.getDouble(<span style="color: #008000;">"ville_latitude_deg"</span>)
                                            , (<span style="color: #6434A3;">Integer</span>)rs.getObject(<span style="color: #008000;">"ville_zmin"</span>)
                                            , (<span style="color: #6434A3;">Integer</span>)rs.getObject(<span style="color: #008000;">"ville_zmax"</span>)));
                    }<span style="color: #0000FF;">catch</span>(<span style="color: #6434A3;">Exception</span> <span style="color: #BA36A5;">e</span>){
                        System.err.println(e);
                    }
                }
            }<span style="color: #0000FF;">catch</span> (<span style="color: #6434A3;">SQLException</span> <span style="color: #BA36A5;">e</span>){
                System.err.println(e);
            }
            <span style="color: #0000FF;">return</span> res;
        }
</pre>
</div>

<p>
On lit des (références vers des) objets plutôt que des valeurs de types
primitifs lorsque les colonnes peuvent contenir des <code>NULL</code>, auquel cas la
référence retournées est nulle.
</p>


<p>
Il est aussi possible de tirer parti de la correspondance entre tables et
classe, pour automatiser la persistance des objets d'un programme Java. Ceci
grâce à <a href="https://fr.wikipedia.org/wiki/Java_Persistence_API">Java Persistance Api</a>.
</p>
</div>
</div>
