session2/cours/sgdbr.md


<a id="org38d87f2"></a>

## Lecture des résultats d'une requête SELECT

Lorsque l'on exécute une requête `SELECT`, on utilise la méthode [executeQuery()](https://docs.oracle.com/javase/7/docs/api/java/sql/PreparedStatement.html#executeQuery()) qui retourne un objet implémentant l'interface [java.sql.ResultSet](https://docs.oracle.com/javase/7/docs/api/java/sql/ResultSet.html). Cet objet permet de récupérer chacunes des données de chacune des lignes correspondant à la requête. Pour passer à la ligne suivante en testant s'il y en a une, on utilise la méthode [next()](https://docs.oracle.com/javase/7/docs/api/java/sql/ResultSet.html#next()) (le plus souvent comme condition de continuation dans une boucle `while()` pour traiter toutes les lignes de la première à la dernière). Ensuite, pour chacune des lignes (à l'intérieur de la boucle, donc), on peut récupérer la valeur de chacune des colonnes avec des appels aux méthodes [getDouble(String colName)](https://docs.oracle.com/javase/7/docs/api/java/sql/ResultSet.html#getDouble(java.lang.String)), [getInt(String colName)](https://docs.oracle.com/javase/7/docs/api/java/sql/ResultSet.html#getInt(java.lang.String)), [getLong(String colName)](https://docs.oracle.com/javase/7/docs/api/java/sql/ResultSet.html#getLong(java.lang.String)), [getString(String colName)](https://docs.oracle.com/javase/7/docs/api/java/sql/ResultSet.html#getString(java.lang.String)) et autres. Il est aussi possible de passer des numéros de colonne en argument plutôt que d'utiliser les noms, mais il faut alors se souvenir non seulement de l'ordre des colonnes dans le resultat, mais aussi que leur numérotation commence à 1 et non à 0. Toujours dans un soucis de plus grande compatibilité avec tous les drivers JDBC disponibles, mais aussi dans un soucis de performance, il est préférable de se contenter de lire les lignes les unes après les autres et pour chaque ligne et de ne lire les données qu'une seule fois pour une instance de `ResultSet` donnée.

Par exemple, pour construire une liste d'objets de classe `CityDTO` à partir du résultat d'une requête SQL sur une connection donnée, on pourrait écrire :

```java
        private static List<CityDTO> readValues(Connection conn){
            List<CityDTO> res= new ArrayList<CityDTO>();
            try(Statement stmt= conn.createStatement()){
                ResultSet rs= stmt.executeQuery(readQuery);
                while(rs.next()){
                    try {
                    Float villeSurface = (Float) rs.getObject("ville_surface");

                        res.add(new CityDTO(rs.getString("ville_nom_reel")
                                            , rs.getString("ville_departement")
                                            , rs.getString("ville_code_postal")
                                            , (Integer)rs.getObject("ville_population_1999")
                                            , (Integer)rs.getObject("ville_population_2010")
                                            , (Integer)rs.getObject("ville_population_2012")
                                            , villeSurface == null ? (Double) null : new Double(villeSurface.doubleValue())
                                            , rs.getDouble("ville_longitude_deg")
                                            , rs.getDouble("ville_latitude_deg")
                                            , (Integer)rs.getObject("ville_zmin")
                                            , (Integer)rs.getObject("ville_zmax")));
                    }catch(Exception e){
                        System.err.println(e);
                    }
                }
            }catch (SQLException e){
                System.err.println(e);
            }
            return res;
        }
```

On lit des (références vers des) objets plutôt que des valeurs de types primitifs lorsque les colonnes peuvent contenir des `NULL`, auquel cas la référence retournées est nulle.

Il est aussi possible de tirer parti de la correspondance entre tables et classe, pour automatiser la persistance des objets d'un programme Java. Ceci grâce à [Java Persistance Api](https://fr.wikipedia.org/wiki/Java_Persistence_API).
