session2/cours/sgdbr.html


<div id="outline-container-org63f18a2" class="outline-3">
<h3 id="org63f18a2"><span class="section-number-3">10.4</span> Exemple de relation Many to Many, table d'associations</h3>
<div class="outline-text-3" id="text-10-4">
<p>
Pour le stockage de l'information concernant les codes postaux de chacune des
villes, le format proposé (une colonne de type chaîne de caractères pouvant
contenir une liste de codes postaux séparés par des '-', n'est ni pratique ni
performant. On va écrire un programme implémentant la relation «Many to Many»
par une table d'associations. Il s'agit d'une relation «Many to Many» car une
ville peut avoir plusieurs codes postaux, mais un code postal peut être associé
à plusieurs villes. Pour représenter cette association, on va créer deux tables :
</p>
<ul class="org-ul">
<li>une table <code>postalcodes</code> qui va contenir la chaîne de caractère du code
postal et un identifiant.</li>
<li>une table <code>city_postalcode</code> qui va contenir les associations entre la table
<code>cities</code> et la table <code>postalcodes</code>, avec seulement les deux colonnes
<code>cities_pk</code> et <code>postalcodes_pk</code> ("pk" pour Primary Key). La clé primaire de
cette table est constituée par ces deux colonnes.</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2019-11-11 Mon 23:28</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
