session2/cours/sgdbr.md


<a id="org3d77a78"></a>

## Exemple de relation Many to Many, table d'associations

Pour le stockage de l'information concernant les codes postaux de chacune des villes, le format proposé (une colonne de type chaîne de caractères pouvant contenir une liste de codes postaux séparés par des '-', n'est ni pratique ni performant. On va écrire un programme implémentant la relation «Many to Many» par une table d'associations. Il s'agit d'une relation «Many to Many» car une ville peut avoir plusieurs codes postaux, mais un code postal peut être associé à plusieurs villes. Pour représenter cette association, on va créer deux tables :

-   une table `postalcodes` qui va contenir la chaîne de caractère du code postal et un identifiant.
-   une table `city_postalcode` qui va contenir les associations entre la table `cities` et la table `postalcodes`, avec seulement les deux colonnes `cities_pk` et `postalcodes_pk` ("pk" pour Primary Key). La clé primaire de cette table est constituée par ces deux colonnes.
